Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_collaborator.this["aegir-typedoc-theme:hugomrdias"] will be destroyed
  # (because key ["aegir-typedoc-theme:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "aegir-typedoc-theme:hugomrdias" -> null
      - permission = "admin" -> null
      - repository = "aegir-typedoc-theme" -> null
      - username   = "hugomrdias" -> null
    }

  # github_repository_collaborator.this["aegir:hugomrdias"] will be destroyed
  # (because key ["aegir:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "aegir:hugomrdias" -> null
      - permission = "admin" -> null
      - repository = "aegir" -> null
      - username   = "hugomrdias" -> null
    }

  # github_repository_collaborator.this["go-libipfs:ajnavarro"] will be destroyed
  # (because key ["go-libipfs:ajnavarro"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "go-libipfs:ajnavarro" -> null
      - permission = "admin" -> null
      - repository = "go-libipfs" -> null
      - username   = "ajnavarro" -> null
    }

  # github_repository_collaborator.this["in-web-browsers:hugomrdias"] will be destroyed
  # (because key ["in-web-browsers:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "in-web-browsers:hugomrdias" -> null
      - permission = "push" -> null
      - repository = "in-web-browsers" -> null
      - username   = "hugomrdias" -> null
    }

  # github_repository_collaborator.this["ipfs-blog:ckmwrites"] will be destroyed
  # (because key ["ipfs-blog:ckmwrites"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ipfs-blog:CKMwrites" -> null
      - permission = "push" -> null
      - repository = "ipfs-blog" -> null
      - username   = "CKMwrites" -> null
    }

  # github_repository_collaborator.this["ipfs-docs:dannys03"] will be destroyed
  # (because key ["ipfs-docs:dannys03"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ipfs-docs:DannyS03" -> null
      - permission = "maintain" -> null
      - repository = "ipfs-docs" -> null
      - username   = "DannyS03" -> null
    }

  # github_repository_collaborator.this["ipfs-docs:jennijuju"] will be destroyed
  # (because key ["ipfs-docs:jennijuju"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ipfs-docs:jennijuju" -> null
      - permission = "maintain" -> null
      - repository = "ipfs-docs" -> null
      - username   = "jennijuju" -> null
    }

  # github_repository_collaborator.this["ipfs-docs:walkerlj0"] must be replaced
-/+ resource "github_repository_collaborator" "this" {
      ~ id                          = "ipfs-docs:walkerlj0" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ permission                  = "maintain" -> "triage" # forces replacement
      + permission_diff_suppression = false
        # (2 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["ipfs-docs:yusefnapora"] will be destroyed
  # (because key ["ipfs-docs:yusefnapora"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ipfs-docs:yusefnapora" -> null
      - permission = "maintain" -> null
      - repository = "ipfs-docs" -> null
      - username   = "yusefnapora" -> null
    }

  # github_repository_collaborator.this["ipfs-webui:djmcquillan"] must be replaced
-/+ resource "github_repository_collaborator" "this" {
      ~ id                          = "ipfs-webui:djmcquillan" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ permission                  = "push" -> "triage" # forces replacement
      + permission_diff_suppression = false
        # (2 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["ipfs-webui:hugomrdias"] will be destroyed
  # (because key ["ipfs-webui:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ipfs-webui:hugomrdias" -> null
      - permission = "push" -> null
      - repository = "ipfs-webui" -> null
      - username   = "hugomrdias" -> null
    }

  # github_repository_collaborator.this["js-ipfs-utils:hugomrdias"] will be destroyed
  # (because key ["js-ipfs-utils:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "js-ipfs-utils:hugomrdias" -> null
      - permission = "maintain" -> null
      - repository = "js-ipfs-utils" -> null
      - username   = "hugomrdias" -> null
    }

  # github_repository_collaborator.this["js-ipfsd-ctl:hugomrdias"] will be destroyed
  # (because key ["js-ipfsd-ctl:hugomrdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "js-ipfsd-ctl:hugomrdias" -> null
      - permission = "admin" -> null
      - repository = "js-ipfsd-ctl" -> null
      - username   = "hugomrdias" -> null
    }

  # github_team_membership.this["docs-writers:yusefnapora"] will be destroyed
  # (because key ["docs-writers:yusefnapora"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"0b4f2b9c9f68b84d6570dc8cc42bc499510425a014986f11d524dc16bb2ed4e2\"" -> null
      - id       = "6142866:yusefnapora" -> null
      - role     = "member" -> null
      - team_id  = "6142866" -> null
      - username = "yusefnapora" -> null
    }

  # github_team_membership.this["go-ipfs-priv:ajnavarro"] will be destroyed
  # (because key ["go-ipfs-priv:ajnavarro"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"2c094396f1902faca3fd618f2a5d19db958aa9c22e1b6b40ad3ec49e4a622277\"" -> null
      - id       = "5789902:ajnavarro" -> null
      - role     = "member" -> null
      - team_id  = "5789902" -> null
      - username = "ajnavarro" -> null
    }

  # github_team_membership.this["repos - go:coryschwartz"] will be destroyed
  # (because key ["repos - go:coryschwartz"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"bb2dac7069393d3428f41498a5b3c0cb23457864915140080056f826870bc779\"" -> null
      - id       = "3232508:coryschwartz" -> null
      - role     = "member" -> null
      - team_id  = "3232508" -> null
      - username = "coryschwartz" -> null
    }

  # github_team_membership.this["repos - javascript:hugomrdias"] will be destroyed
  # (because key ["repos - javascript:hugomrdias"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"c7b88bc1752e91e7d5cbbf03ae30e3bce5aed91d48ec491d6cc069910816e195\"" -> null
      - id       = "1433120:hugomrdias" -> null
      - role     = "member" -> null
      - team_id  = "1433120" -> null
      - username = "hugomrdias" -> null
    }

  # github_team_membership.this["repos - javascript:yusefnapora"] will be destroyed
  # (because key ["repos - javascript:yusefnapora"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"0809ab55518508c230b1fb3068fc21615f0aee4fc0e627bbe8b08d3dd9fb13e4\"" -> null
      - id       = "1433120:yusefnapora" -> null
      - role     = "member" -> null
      - team_id  = "1433120" -> null
      - username = "yusefnapora" -> null
    }

  # github_team_membership.this["w3dt-stewards:ajnavarro"] will be destroyed
  # (because key ["w3dt-stewards:ajnavarro"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"46ca9cee7922fce4baab4d792d378de460ccc99093cf05a802fd2e86f1c1158f\"" -> null
      - id       = "4656983:ajnavarro" -> null
      - role     = "member" -> null
      - team_id  = "4656983" -> null
      - username = "ajnavarro" -> null
    }

  # github_team_membership.this["w3dt-stewards:stebalien"] will be destroyed
  # (because key ["w3dt-stewards:stebalien"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"b6d698616b801f07647ef3fd1054583c7252765096ad9a8c5bcf04ec5a48edfb\"" -> null
      - id       = "4656983:Stebalien" -> null
      - role     = "maintainer" -> null
      - team_id  = "4656983" -> null
      - username = "Stebalien" -> null
    }

  # github_team_membership.this["w3dt-stewards:tinytb"] will be destroyed
  # (because key ["w3dt-stewards:tinytb"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"aab1be3777984d4d8d3f028a9b8ac04bb6c6b3d522338ff36bb6aa231fc85c8e\"" -> null
      - id       = "4656983:tinytb" -> null
      - role     = "maintainer" -> null
      - team_id  = "4656983" -> null
      - username = "tinytb" -> null
    }

  # github_team_membership.this["w3dt-stewards:wilkyr31d"] will be destroyed
  # (because key ["w3dt-stewards:wilkyr31d"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"81eab291cd749f564d57f797d41139d389250c0abbbdf9caaae62fb10acd7175\"" -> null
      - id       = "4656983:wilkyr31d" -> null
      - role     = "member" -> null
      - team_id  = "4656983" -> null
      - username = "wilkyr31d" -> null
    }

  # github_team_repository.this["admin:go-libipfs"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-libipfs"
      + team_id    = "1516991"
    }

  # github_team_repository.this["w3dt-stewards:go-libipfs"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-libipfs"
      + team_id    = "4656983"
    }

Plan: 4 to add, 0 to change, 22 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->